'''
[문제] 딕셔너리 객체를 이용한 전화번호부 프로그램을 작성하십시오.
    조건1) 다음 학생을 dic변수에 사전 형태로 대입하시오
        [등록된 학생]
        홍길동: 010-1111-1111
        이순신: 010-1111-2222
        강감찬: 010-1111-3333
    조건2)학생의 이름만 출력하시오
    조건3)학생의 이름을 입력받아 이름과 전화번호를 출력하시오

[입.출력화면]
아래 학생들의 전화번호를 조회할 수 있습니다.
홍길동
이순신
강감찬
전화번호를 조회하고자 하는 학생의 이름을 입력하십시오: 홍길동

홍길동의 전화번호는 010-1111-1111입니다.
'''
#------------------------------------------------
dic = { "홍길동": "010-1111-1111", "이순신": "010-1111-2222", "강감찬": "010-1111-3333"}
print("아래 학생들의 전화번호를 조회할 수 있습니다.")
